# -*- coding=utf-8 -*-

import random
import string


charcter = u"式动扛寺吉扣考托执巩圾扩扫地扬场耳共芒亚芝朽朴机权过臣再协西压厌在有百存而页匠夸夺灰达列成夹划" \
           u"迈毕至此贞师尘尖光当早曲团同吃屿帆回刚则朱先竹迁乔伟传休伍伏优伐延件任价份华仰自血向似后行舟全会" \
           u"合兆企众伞创朵杂危旬旨各名多争壮冲冰庄庆亦刘齐交次衣产决充妄闭问闯并关灯州汗污江池汤兴宇守宅字安" \
           u"讲军许论农讽设访寻那迅尽导异孙阵阳收阶阴防如好戏羽观欢红纤级纪驰巡寿弄麦形进戒吞远违运扶抚坛技" \
           u"坏扰拒找批扯址走抄坝贡攻赤折抓扮抢孝均抛投坟抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏" \
           u"杆杠杜材村杏极李杨求更束豆两丽辰励否还来连步坚旱盯呈时吴助县里呆园旷围呀吨足邮男困吵串听吩吹吼" \
           u"别岗帐财针钉告乱利秃秀私每兵估体何但伸作伯伶佣低你住位伴身皂佛近彻役返余希坐谷妥含邻岔肝肚肠龟" \
           u"免狂犹角删条卵岛迎饭饮系言冻状亩况床库疗应冷这序辛弃冶忘闲间闷判灶灿弟汪沙汽沃泛沟没沈沉怀忧快" \
           u"完宋宏牢究穷灾良证启评补初社识诉诊词译君灵即层尿尾迟局改张忌际陆阿陈阻附妙妖妨努忍劲鸡驱纯纱纳纲" \
           u"驳纵纷纸纹纺驴纽玉刊示末未击打巧正扑扒功扔去甘世古节本术可丙左厉右石布龙平灭轧东卡北占业旧帅归" \
           u"且旦目叶甲申叮电号田由史只央兄叼叫另叨叹四生失禾丘付仗代仙们仪白仔他斥瓜乎丛令用甩印乐句匆册犯" \
           u"外处冬鸟务包饥主市立闪兰半汁汇头汉宁穴它讨写让礼训必议讯记永司尼民出辽奶奴加召皮边发孕圣对台矛" \
           u"纠母幼丝奉玩环武青责现表规抹拢拔拣担坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌幸招坡披拨择抬其取苦若" \
           u"茂苹苗英范直茄茎茅林枝杯柜析板松枪构杰述枕丧或画卧事刺枣雨卖矿码厕奔奇奋态欧垄妻轰顷转斩轮软到" \
           u"非叔肯齿些虎虏肾贤尚旺具果味昆国昌畅明易昂典固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩购图钓制知垂牧物乖刮" \
           u"秆和季委佳侍供使例版侄侦侧凭侨佩货依的迫质欣征往爬彼径所舍金命斧爸采受乳贪念贫肤肺肢肿胀朋股肥" \
           u"服胁周昏鱼兔狐忽狗备饰饱饲变京享店夜庙府底剂郊废净盲放刻育闸闹郑券卷单炒炊炕炎炉沫浅法泄河沾泪油" \
           u"泊沿泡注泻泳泥沸波泼泽治怖怕怜怪学宝宗定宜审宙官空帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届" \
           u"刷屈弦承孟孤陕降限妹姑姐姓始驾参艰线练组细驶织终驻驼绍经贯"

familyname = u"赵钱孙李周吴郑王冯陈楮卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭" \
             u"郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平" \
             u"黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闽席季麻强贾路娄危江童颜" \
             u"郭梅盛林刁锺徐丘骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮" \
             u"龚程嵇邢滑裴陆荣翁荀羊於惠甄麹家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊" \
             u"宫宁仇栾暴甘斜厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴郁胥能苍" \
             u"双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍郤璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼" \
             u"容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶" \
             u"空曾毋沙乜养鞠须丰巢关蒯相查后荆红游竺权逑盖益桓公"

eng = ['z', 'y', 'x', 'w', 'v', 'u', 't', 's', 'r', 'q', 'p', 'o', 'n', 'm', 'l', 'k', 'j', 'i', 'h', 'g', 'f', 'e',
       'd', 'c', 'b', 'a', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R',
       'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']


def addcode():
    code = string.join(random.sample(eng, 7)).replace(' ', '')
    return code


def add_code_by_need(no):
    code = ""
    if no < 1:
        no = 1
    for i in range(no):
        code += random.choice(eng)
    return code


def addcharacter():
    cha = ""
    for i in range(6):
        cha += random.choice(charcter)
    return cha


def addname():
    fa = random.choice(familyname)
    name = ''
    for i in range(random.randint(2, 3)):
        name += random.choice(charcter)
    return fa + name


# 根据需要汉字数量添加
def addcharbyneed(no):
    cha = ""
    if no < 1:
        no = 1
    for i in range(no):
        cha += random.choice(charcter)
    return cha


def add_code_by_need(no):
    code = ""
    if no < 1:
        no = 1
    for i in range(no):
        code += random.choice(eng)
    return code